Load-tests/load-test.yml
config:
  target: http://localhost:5100
  phases:
    - duration: 120
      arrivalRate: 1000
      rampTo: 1000
      name: Startup phase

scenarios:
  - name: "Trigger autoscaler"
    flow:
      - post:
          url: "/createstat"
          json:
            "Testname": "Test X"
            "TestStat": "Hello world!"